---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceLoopsOfSplittingCurves
source: html/072e1e86-5ddf-b23c-9f18-9ead2ed9899d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceLoopsOfSplittingCurves Property

Curve elements forming a closed loop currently cannot be used as splitters and are ignored.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceLoopsOfSplittingCurves { get; }
```